In [68]:
import pandas as pd
import numpy as np 
from numpy import nan as NA

string_data = pd.Series(["Kshitij", "Phenyl", "Taara", np.nan, "Ted"])
string_data

0    Kshitij
1     Phenyl
2      Taara
3        NaN
4        Ted
dtype: object

Suppose you wanted to find values in one of the columns exceeding 3 in absolute
value:

In [69]:
string_data.isnull()
string_data[0] = NA
string_data

0       NaN
1    Phenyl
2     Taara
3       NaN
4       Ted
dtype: object

In [70]:
string_data.dropna()

1    Phenyl
2     Taara
4       Ted
dtype: object

In [71]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 [NA, NA, NA], [NA, 6.5, 3.]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [72]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA
Passing axis = 1, how = "all"

In [73]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -2.076512 -1.024038 -0.642934
1 -1.115607  0.284537  0.191028
2  0.296204 -1.034551  1.409521
3 -0.241811  0.854572  0.500821
4 -2.836285 -1.207186  0.596823
5 -1.421073 -1.819127  1.642040
6 -0.648543 -1.601437 -0.694394

In [74]:
df.iloc[:4, 1] = NA
df.iloc[:3, 2] = NA
df

          0         1         2
0 -2.076512       NaN       NaN
1 -1.115607       NaN       NaN
2  0.296204       NaN       NaN
3 -0.241811       NaN  0.500821
4 -2.836285 -1.207186  0.596823
5 -1.421073 -1.819127  1.642040
6 -0.648543 -1.601437 -0.694394

In [75]:
df.dropna(thresh= 2)

          0         1         2
3 -0.241811       NaN  0.500821
4 -2.836285 -1.207186  0.596823
5 -1.421073 -1.819127  1.642040
6 -0.648543 -1.601437 -0.694394

In [76]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -2.076512  0.000000  0.000000
1 -1.115607  0.000000  0.000000
2  0.296204  0.000000  0.000000
3 -0.241811  0.000000  0.500821
4 -2.836285 -1.207186  0.596823
5 -1.421073 -1.819127  1.642040
6 -0.648543 -1.601437 -0.694394

In [77]:
df_fillna = pd.DataFrame(np.random.randn(6, 3))
df_fillna.iloc[2:, 1] = NA
df_fillna.iloc[4:, 2] = NA
df_fillna

          0         1         2
0 -0.255060  1.509266  0.344028
1  0.353074  0.729009 -0.610271
2  0.929088       NaN  0.741975
3  0.844999       NaN -0.918048
4  0.322149       NaN       NaN
5  0.413798       NaN       NaN

In [78]:
df_fillna.fillna(method= "ffill")

          0         1         2
0 -0.255060  1.509266  0.344028
1  0.353074  0.729009 -0.610271
2  0.929088  0.729009  0.741975
3  0.844999  0.729009 -0.918048
4  0.322149  0.729009 -0.918048
5  0.413798  0.729009 -0.918048

In [79]:
df_fillna.fillna(method= "ffill", limit=2)

# ffill will fill all the blanks with the values of the previous cell and by setting a limit, we can 
# decide till how many cells we have to copy the values.

          0         1         2
0 -0.255060  1.509266  0.344028
1  0.353074  0.729009 -0.610271
2  0.929088  0.729009  0.741975
3  0.844999  0.729009 -0.918048
4  0.322149       NaN -0.918048
5  0.413798       NaN -0.918048

With fillna you can do lots of other things with a little creativity. For example, you
might pass the mean or median value of a Series:

In [80]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Data Transformation

- Removing Duplicates

In [81]:
transformation = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})
transformation

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

data.duplicated() shows the bool values for whether each row is a duplicate of any other

In [82]:
transformation.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [83]:
transformation.drop_duplicates()

# drops the last duplicate last row

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Alternatively, you can
specify any subset of columns to detect duplicates.

In [84]:
transformation['v1'] = range(7)
transformation

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [85]:
transformation.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

.duplicated() and .drop_duplicates() by default keep the first observed value combination.
 Passing keep='last' will return the last one:

In [86]:
transformation.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

Transforming Data Using a Function or Mapping

In [87]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
  'Pastrami', 'corned beef', 'Bacon',
  'pastrami', 'honey ham', 'nova lox'],
  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose you wanted to add a column indicating the type of animal that each food
came from. Let’s write down a mapping of each distinct meat type to the kind of
animal:

In [88]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

The map method on a Series accepts a function or dict-like object containing a map‐
ping, but here we have a small problem in that some of the meats are capitalized and
others are not. Thus, we need to convert each value to lowercase using the str.lower
Series method:

In [89]:
lowercased = data['food'].str.lower()
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Replacing values.

In [90]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [91]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [92]:
# If you want to replace multiple values at once, you instead pass a list and then the
#substitute value:

data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [93]:
# To use a different replacement for each value, pass a list of substitutes:

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [94]:
# easier way to do this

data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

Discretisation and Binning

In [95]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
# do so, you have to use cut, a function in pandas:

bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [96]:
# now cats is an object, but it is an categorical object, which means it has attributtes such as codes, categories, and pd.value_counts(cats)

cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [97]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [98]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

Note that pd.value_counts(cats) are the bin counts for the result of pandas.cut.
Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive). You can change which
side is closed by passing right=False:

In [99]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [100]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    0.970330  0.209339 -0.743187  1.982763
1    0.710336  0.527427 -0.843067  0.834922
2   -0.457210 -0.868222  1.055243  0.399237
3   -0.326852  0.638982  0.331698 -0.523913
4    0.663722 -1.585436  0.405561  0.518055
..        ...       ...       ...       ...
995  0.550144 -1.739269 -2.040258  1.354078
996  0.227229  0.972443  0.894918 -0.699479
997  0.617676 -0.213901 -0.458717 -0.532989
998  1.352188 -0.534751 -2.775244  0.433790
999  2.105999 -1.243068  0.426908  0.091045

[1000 rows x 4 columns]

Suppose you wanted to find values in one of the columns exceeding 3 in absolute
value:

In [101]:
col = data[2]
col[np.abs(col)>3]

890    3.091042
Name: 2, dtype: float64

To select all rows having a value exceeding 3 or –3, you can use the any method on a
boolean DataFrame:

In [102]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
6    0.633869 -4.141247 -1.170972  1.312105
13  -1.807051 -0.327143 -1.222450 -3.292247
242  0.225268 -3.006171 -0.930282  0.600399
275 -3.157886  0.064663 -0.747244  0.019676
380 -3.627493  1.392374  1.189754 -0.795686
507 -1.585437 -1.159325  0.799164 -3.284153
890 -0.008616  1.442131  3.091042  0.171314

In [103]:
# The statement np.sign(data) produces 1 and –1 values based on whether the values
# in data are positive or negative:

np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0  1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

Permutation and Random Sampling

In [104]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [109]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 3, 0, 2])

In [110]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

To select a random subset without replacement, you can use the sample method on
Series and DataFrame:

In [117]:
df.sample(n=2)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19

To generate a sample with replacement (to allow repeat choices), pass replace=True
to sample:

In [126]:
df.sample(n=3, replace= True)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
1   4   5   6   7

Computing Indicator/Dummy Variables

In [127]:
# In many string munging and scripting applications, built-in string methods are suffi‐
# cient. As an example, a comma-separated string can be broken into pieces with
# split:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [131]:
# split is often combined with strip to trim whitespace (including line breaks):

pieces = [x.strip() for x in val.split(',')]

for piece in pieces: 
    piece

a
b
guido